### Codio Activity 4.1: Basic Joins on Datasets

**Expected Time: 60 Minutes**

**Total Points: 10 Points**

This activity focuses on using the `merge` function to join DataFrame's as seen in Videos 4.1 and 4.2.  Merging DataFrames allows the combination of data along a shared categorical column.  The DataFrames do not need to be the same shape and depending on certain arguments used, the result of a merge can contain different values.  Specifically, using different kinds of joins -- `inner, outer, left, right`, different DataFrames are produced.  

## Index:

- [Problem 1](#Problem-1)
- [Problem 2](#Problem-2)
- [Problem 3](#Problem-3)
- [Problem 4](#Problem-4)
- [Problem 5](#Problem-5)

In [1]:
import pandas as pd

### The Data: Antarctic Weather Stations

The dataset for this activity is four `.csv` files.  The file names and descriptions of the data are as follows:

- `person.csv`: people who took readings.
- `site.csv`: locations where readings were taken.
- `visited.csv`: when readings were taken at specific sites.
- `survey.csv`: the actual readings. The field quant is short for quantity and indicates what is being measured. Values are rad, sal, and temp referring to ‘radiation’, ‘salinity’ and ‘temperature’, respectively.

Each dataset is loaded below, and basic info displayed.

In [2]:
site = pd.read_csv('/Users/jaikumar/Desktop/Berkeley_ML/codio_4.1_solution/data/site.csv')

In [15]:
site

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [4]:
site.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   lat     3 non-null      float64
 2   long    3 non-null      float64
dtypes: float64(2), object(1)
memory usage: 204.0+ bytes

In [5]:
visited = pd.read_csv('/Users/jaikumar/Desktop/Berkeley_ML/codio_4.1_solution/data/visited.csv')

In [14]:
visited

    id   site       dated
0  619   DR-1  1927-02-08
1  622   DR-1  1927-02-10
2  734   DR-3  1930-01-07
3  735   DR-3  1930-01-12
4  751   DR-3  1930-02-26
5  752   DR-3         NaN
6  837  MSK-4  1932-01-14
7  844   DR-1  1932-03-22

In [7]:
visited.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      8 non-null      int64
 1   site    8 non-null      object
 2   dated   7 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

In [8]:
person = pd.read_csv('/Users/jaikumar/Desktop/Berkeley_ML/codio_4.1_solution/data/person.csv')
person.head(2)

     id personal   family
0  dyer  William     Dyer
1    pb    Frank  Pabodie

In [9]:
survey = pd.read_csv('/Users/jaikumar/Desktop/Berkeley_ML/codio_4.1_solution/data/survey.csv')
survey.head(2)

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13

In [10]:
survey.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   taken    21 non-null     int64
 1   person   19 non-null     object
 2   quant    21 non-null     object
 3   reading  21 non-null     float64
dtypes: float64(1), int64(1), object(2)
memory usage: 804.0+ bytes

### KL

[Back to top](#Index:) 

### Problem 1

#### Merging site and visited

**5 Points**

Note that in the site data the name column is the same information as in the visited `site` column.  Use  `pd.merge` to merge the site with the visited based on the shared column.  Use `site` as your left DataFrame and `visited` as your right.  Assign your result as a DataFrame to `site_visits_df` below.

In [12]:
### GRADED

site_visits_df = None

### BEGIN SOLUTION
site_visits_df = pd.merge(site, visited, left_on='name', right_on='site')
type(site_visits_df)
### END SOLUTION

# Answer check
print(type(site_visits_df), site_visits_df.shape)
print(site_visits_df.head())

<class 'pandas.core.frame.DataFrame'> (8, 6)
   name    lat    long   id  site       dated
0  DR-1 -49.85 -128.57  619  DR-1  1927-02-08
1  DR-1 -49.85 -128.57  622  DR-1  1927-02-10
2  DR-1 -49.85 -128.57  844  DR-1  1932-03-22
3  DR-3 -47.15 -126.72  734  DR-3  1930-01-07
4  DR-3 -47.15 -126.72  735  DR-3  1930-01-12

[Back to top](#Index:) 

### Problem 2

#### Revisit with shared Column Name

**5 Points**


Now, before merging the data rename the `visited` data column `site` to `name`, and merge using the `on` argument to specify the shared column name.  Assign the renamed data to `visited_renamed` below, and the result of the merge to `site_visits_df2` below.  Note that your solution should have one column fewer than the solution to problem 1.

In [24]:
### GRADED

visited_renamed = None
site_visits_df2 = None

### BEGIN SOLUTION
visited_renamed = visited.rename({'site': 'name'}, axis = 1)
site_visits_df2 = pd.merge(site, visited_renamed, on = 'name')
### END SOLUTION

# Answer check
print(site_visits_df2.shape)
site_visits_df2.head()

(8, 5)

   name    lat    long   id       dated
0  DR-1 -49.85 -128.57  619  1927-02-08
1  DR-1 -49.85 -128.57  622  1927-02-10
2  DR-1 -49.85 -128.57  844  1932-03-22
3  DR-3 -47.15 -126.72  734  1930-01-07
4  DR-3 -47.15 -126.72  735  1930-01-12

[Back to top](#Index:) 

### Problem 3

#### Merging the Survey Results

**5 Points**

The effect of merging the `site` and `visited` is that a DataFrame with each sites name, location, visit id, and date has been created. 

To include the data collected at each site in these visits, the survey data needs to be consulted.  

Identify the shared column in the `site_visits_df2` data and the `survey` data, and merge the data based on this column.  

Rename the column in the `survey` frame appropriately so as to not have a reduntant column in the data and assign your merged DataFrame to `survey_site_visits` below.

In [15]:
site_visits_df2.head(2)

   name    lat    long   id       dated
0  DR-1 -49.85 -128.57  619  1927-02-08
1  DR-1 -49.85 -128.57  622  1927-02-10

In [16]:
survey.head(2)

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13

In [29]:
### GRADED

survey_site_visits = None

survey_renamed = survey.rename(columns = {"taken":"id"})
#survey_renamed
survey_site_visits = pd.merge(survey_renamed, site_visits_df2, on = "id")

# Answer check
print(survey_site_visits)
print(type(survey_site_visits))

     id person quant  reading   name    lat    long       dated
0   619   dyer   rad     9.82   DR-1 -49.85 -128.57  1927-02-08
1   619   dyer   sal     0.13   DR-1 -49.85 -128.57  1927-02-08
2   622   dyer   rad     7.80   DR-1 -49.85 -128.57  1927-02-10
3   622   dyer   sal     0.09   DR-1 -49.85 -128.57  1927-02-10
4   734     pb   rad     8.41   DR-3 -47.15 -126.72  1930-01-07
5   734   lake   sal     0.05   DR-3 -47.15 -126.72  1930-01-07
6   734     pb  temp   -21.50   DR-3 -47.15 -126.72  1930-01-07
7   735     pb   rad     7.22   DR-3 -47.15 -126.72  1930-01-12
8   735    NaN   sal     0.06   DR-3 -47.15 -126.72  1930-01-12
9   735    NaN  temp   -26.00   DR-3 -47.15 -126.72  1930-01-12
10  751     pb   rad     4.35   DR-3 -47.15 -126.72  1930-02-26
11  751     pb  temp   -18.50   DR-3 -47.15 -126.72  1930-02-26
12  751   lake   sal     0.10   DR-3 -47.15 -126.72  1930-02-26
13  752   lake   rad     2.19   DR-3 -47.15 -126.72         NaN
14  752   lake   sal     0.09   DR-3 -47.15 -126.72         NaN
15  752   lake  temp   -16.00   DR-3 -47.15 -126.72         NaN
16  752    roe   sal    41.60   DR-3 -47.15 -126.72         NaN
17  837   lake   rad     1.46  MSK-4 -48.87 -123.40  1932-01-14
18  837   lake   sal     0.21  MSK-4 -48.87 -123.40  1932-01-14
19  837    roe   sal    22.50  MSK-4 -48.87 -123.40  1932-01-14
20  844    roe   rad    11.25   DR-1 -49.85 -128.57  1932-03-22
<class 'pandas.core.frame.DataFrame'>

[Back to top](#Index:) 

### Problem 4

### Adding Full Names

**5 Points**

Finally, use the `survey_site_visits` dataframe together with the `person` data to create a single DataFrame that includes the personal and family name columns in each observation.  Rename the shared column in both to `person_id` and join on this with `survey_site_visits` acting as your left DataFrame.  Assign your results to `full_name_df` below.

In [16]:
person

         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [28]:
### GRADED

full_name_df = None

### BEGIN SOLUTION
left = survey_site_visits.rename(columns = {'person': 'person_id'})
right = person.rename(columns = {'id': 'person_id'})
full_name_df = pd.merge(left, right, on = 'person_id')
### END SOLUTION

# Answer check
print(type(full_name_df))
full_name_df

<class 'pandas.core.frame.DataFrame'>

,id,person_id,quant,reading,name,lat,long,dated,personal,family
0,619,dyer,rad,9.82,DR-1,-49.85,-128.57,1927-02-08,William,Dyer
1,619,dyer,sal,0.13,DR-1,-49.85,-128.57,1927-02-08,William,Dyer
2,622,dyer,rad,7.80,DR-1,-49.85,-128.57,1927-02-10,William,Dyer
3,622,dyer,sal,0.09,DR-1,-49.85,-128.57,1927-02-10,William,Dyer
4,734,pb,rad,8.41,DR-3,-47.15,-126.72,1930-01-07,Frank,Pabodie
5,734,pb,temp,-21.50,DR-3,-47.15,-126.72,1930-01-07,Frank,Pabodie
6,735,pb,rad,7.22,DR-3,-47.15,-126.72,1930-01-12,Frank,Pabodie
7,751,pb,rad,4.35,DR-3,-47.15,-126.72,1930-02-26,Frank,Pabodie
8,751,pb,temp,-18.50,DR-3,-47.15,-126.72,1930-02-26,Frank,Pabodie
9,734,lake,sal,0.05,DR-3,-47.15,-126.72,1930-01-07,Anderson,Lake
10,751,lake,sal,0.10,DR-3,-47.15,-126.72,1930-02-26,Anderson,Lake
11,752,lake,rad,2.19,DR-3,-47.15,-126.72,NaN,Anderson,Lake
12,752,lake,sal,0.09,DR-3,-47.15,-126.72,NaN,Anderson,Lake
13,752,lake,temp,-16.00,DR-3,-47.15,-126.72,NaN,Anderson,Lake
14,837,lake,rad,1.46,MSK-4,-48.87,-123.40,1932-01-14,Anderson,Lake
15,837,lake,sal,0.21,MSK-4,-48.87,-123.40,1932-01-14,Anderson,Lake
16,752,roe,sal,41.60,DR-3,-47.15,-126.72,NaN,Valentina,Roerich
17,837,roe,sal,22.50,MSK-4,-48.87,-123.40,1932-01-14,Valentina,Roerich
18,844,roe,rad,11.25,DR-1,-49.85,-128.57,1932-03-22,Valentina,Roerich

[Back to top](#Index:) 

### Problem 5

#### `left` vs. `right` merge

**5 Points**

Below two new DataFrames -- `df1` and `df2` -- are created with the shared column `name`.  Note the different unique values in the `name` column in each.  Use `pd.merge` and choose the appropriate argument for `how` as either `left` or `right` to create the following table:

<table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th></th>      <th>name</th>      <th>age</th>      <th>member</th>    </tr>  </thead>  <tbody>    <tr>      <th>0</th>      <td>amy</td>      <td>32</td>      <td>True</td>    </tr>    <tr>      <th>1</th>      <td>ben</td>      <td>30</td>      <td>NaN</td>    </tr>    <tr>      <th>2</th>      <td>carlos</td>      <td>40</td>      <td>True</td>    </tr>  </tbody></table>

Assign your results to `ans5` below.

In [30]:
df1 = pd.DataFrame({'name': ['amy', 'ben', 'carlos'],
                   'age': [32, 30, 40]})
df2 = pd.DataFrame({'name': ['amy', 'carlos', 'lenny'],
                   'member': [True, True, False]})

In [31]:
### GRADED

ans5 = None

### BEGIN SOLUTION
ans5 = pd.merge(df1, df2, how = 'left', on = 'name')
### END SOLUTION

# Answer check
print(type(ans5))
ans5.head(2)

<class 'pandas.core.frame.DataFrame'>

  name  age member
0  amy   32   True
1  ben   30    NaN